#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Midair_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Midair.ActivatableObject
// 0x0000 (0x0028 - 0x0028)
class UActivatableObject : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.ActivatableObject");
		return ptr;
	}

};


// Class Midair.MAPickup
// 0x0158 (0x04E0 - 0x0388)
class AMAPickup : public AActor
{
public:
	class UProjectileMovementComponent*                ProjectileMovement;                                       // 0x0388(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            Collision;                                                // 0x0390(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            ActionableCollision;                                      // 0x0398(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x03A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               bTimeout;                                                 // 0x03A8(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bResetMeshRotationOnSpawn;                                // 0x03A9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x03AA(0x0006) MISSED OFFSET
	float                                              InteractionCooldownTime;                                  // 0x03B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x03B4(0x0004) MISSED OFFSET
	struct FImpactEffect                               TimeoutEffects;                                           // 0x03B8(0x0108) (Edit, BlueprintVisible)
	class USoundBase*                                  DropSound;                                                // 0x04C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  ImpactSound;                                              // 0x04C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  PickupSound;                                              // 0x04D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ImpulseInheritence;                                       // 0x04D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x04DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.MAPickup");
		return ptr;
	}


	void PlayPickupEffects(class AMAPlayerController* Controller);
	void PlayLandingEffects();
	void OnStop(const struct FHitResult& ImpactResult);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ApplyImpulse_NM(const struct FVector& Impulse);
};


// Class Midair.AmmoPickup
// 0x0068 (0x0548 - 0x04E0)
class AAmmoPickup : public AMAPickup
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x04E0(0x0050) MISSED OFFSET
	class UTargetComponent*                            TargetComponent;                                          // 0x0530(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	class AMAPlayerState*                              RelatedPlayerState;                                       // 0x0538(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FRegenProperties                            RegenProperties;                                          // 0x0540(0x0008) (Edit, BlueprintVisible, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.AmmoPickup");
		return ptr;
	}


	void SetupFromCharacter(class AMACharacter* Character);
	class AMAPlayerState* GetRelatedPlayer();
};


// Class Midair.MAGameMode
// 0x0688 (0x0AF8 - 0x0470)
class AMAGameMode : public AGameMode
{
public:
	class UClass*                                      TeamStateClass;                                           // 0x0470(0x0008) (Edit, BlueprintVisible, ZeroConstructor, NoClear, IsPlainOldData)
	bool                                               bInWarmup;                                                // 0x0478(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0479(0x0007) MISSED OFFSET
	class AMAGameState*                                MAGameState;                                              // 0x0480(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                EndMatchVoteLength;                                       // 0x0488(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                MatchLength;                                              // 0x048C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                PostMatchLength;                                          // 0x0490(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                MapVoteLength;                                            // 0x0494(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              EndMatchMinParticipationPct;                              // 0x0498(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              EndMatchYesVotePctToPass;                                 // 0x049C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                WarmupLength;                                             // 0x04A0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                PreRoundLength;                                           // 0x04A4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                PostRoundLength;                                          // 0x04A8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                WinningScore;                                             // 0x04AC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                MinPlayersToStart;                                        // 0x04B0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bRandomizeTeams;                                          // 0x04B4(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x04B5(0x0003) MISSED OFFSET
	int                                                InvulnerableBaseAssetsBelowPlayerCount;                   // 0x04B8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      MaxDeployableInventoryCount;                              // 0x04BC(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      MaxDeployableTurretCount;                                 // 0x04BD(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      MaxDeployableSensorCount;                                 // 0x04BE(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      MaxRounds;                                                // 0x04BF(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bLimitPlayerLives : 1;                                    // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bShowLastManStanding : 1;                                 // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData02[0x3];                                       // 0x04C1(0x0003) MISSED OFFSET
	float                                              SpawnProtectionTime;                                      // 0x04C4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              BanTimeMinutes;                                           // 0x04C8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              AdminKickAsBanMinutes;                                    // 0x04CC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	bool                                               bPlayersDropBackpackOnDeath;                              // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPlayersDropAmmoOnDeath;                                  // 0x04D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPlayersDropHealthOnDeath;                                // 0x04D2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	bool                                               bRequireLoadoutForSpawn;                                  // 0x04D3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTeamGame;                                                // 0x04D4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsTeamRabbit;                                            // 0x04D5(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBroadcastTeamChangeMessages;                             // 0x04D6(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      NumTeams;                                                 // 0x04D7(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinSuicideDelay;                                          // 0x04D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bLockTeamSpectators;                                      // 0x04DC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseTeamStarts;                                           // 0x04DD(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBalanceTeams;                                            // 0x04DE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x04DF(0x0001) MISSED OFFSET
	int                                                MinPlayersForRebalance;                                   // 0x04E0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                StartRebalanceWarningTime;                                // 0x04E4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                StartRebalanceTime;                                       // 0x04E8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bParentTargetsInheritAlwaysSensed;                        // 0x04EC(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bAllowOvertime;                                           // 0x04ED(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bTeamDamageAllowed;                                       // 0x04EE(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseDistanceSpawnWeighting;                               // 0x04EF(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseTeammateDistanceSpawnWeighting;                       // 0x04F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x04F1(0x0003) MISSED OFFSET
	float                                              SelfDamagePct;                                            // 0x04F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              KillAssistThreshold;                                      // 0x04F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x04FC(0x0004) MISSED OFFSET
	TMap<int, struct FText>                            ScoreDisplayText;                                         // 0x0500(0x0050) (Edit, BlueprintVisible, EditFixedSize, ZeroConstructor)
	struct FGameModeComplexScore                       MaxPoints_DamageContributionToKill;                       // 0x0550(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       Points_LastHitTowardsKill;                                // 0x0568(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       Points_KillAssist;                                        // 0x0580(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       MaxPoints_TurretDamageContributionToKill;                 // 0x0598(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       Points_TurretLastHitTowardsKill;                          // 0x05B0(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       Points_TurretKillAssist;                                  // 0x05C8(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       Points_DestroyInventory;                                  // 0x05E0(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       Points_DestroySensor;                                     // 0x05F8(0x0018) (Edit, BlueprintVisible)
	struct FGameModeComplexScore                       Points_DestroyTurret;                                     // 0x0610(0x0018) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_DestroyGenerator;                                  // 0x0628(0x000C) (Edit, BlueprintVisible)
	float                                              Threshold_SensedEnemyLeadToKill;                          // 0x0634(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGameModeSimpleScore                        Points_SensedEnemyLeadToKill;                             // 0x0638(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_DeployableInventoryUsed;                           // 0x0644(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_RepairingTeammate;                                 // 0x0650(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_RepairingAsset;                                    // 0x065C(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_RepairingVehicle;                                  // 0x0668(0x000C) (Edit, BlueprintVisible)
	float                                              Threshold_DamagingTeammates;                              // 0x0674(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FGameModeSimpleScore                        Points_DamagingTeammates;                                 // 0x0678(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_Teamkill;                                          // 0x0684(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_TeamAssetKill_BaseGen;                             // 0x0690(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_TeamAssetKill_BaseInventory;                       // 0x069C(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_TeamAssetKill_BaseTurret;                          // 0x06A8(0x000C) (Edit, BlueprintVisible)
	struct FGameModeSimpleScore                        Points_TeamAssetKill_BaseSensor;                          // 0x06B4(0x000C) (Edit, BlueprintVisible)
	class UClass*                                      ScoreboardWidgetClass;                                    // 0x06C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      MatchStatusWidgetClass;                                   // 0x06C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<class UClass*, ESensorTrackingType>           SensorTrackingTypeOverrides;                              // 0x06D0(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, ESensorResolutionStrength>     SensorResolutionStrengthOverrides;                        // 0x0720(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, float>                         SensorRangeMultipliers;                                   // 0x0770(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FMALoadout>                          DefaultLoadouts;                                          // 0x07C0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FLoadoutSpawnPenalties                      PerItemLoadoutPenalties;                                  // 0x07D0(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance)
	TArray<class UClass*>                              AvailableWeapons;                                         // 0x07F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              UnavailableWeapons;                                       // 0x0800(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, uint32_t>                      LimitedWeapons;                                           // 0x0810(0x0050) (ZeroConstructor, Deprecated)
	TArray<class UClass*>                              AvailableThrowables;                                      // 0x0860(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              UnavailableThrowables;                                    // 0x0870(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AvailableDeployables;                                     // 0x0880(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              UnavailableDeployables;                                   // 0x0890(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AvailablePacks;                                           // 0x08A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              UnavailablePacks;                                         // 0x08B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              AvailableAugments;                                        // 0x08C0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              UnavailableAugments;                                      // 0x08D0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              UnavailableClasses;                                       // 0x08E0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	bool                                               bVehiclePadsUseTeamPool;                                  // 0x08F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x08F1(0x0007) MISSED OFFSET
	TArray<struct FObjectCount>                        GameMaxObjectsPerTeam;                                    // 0x08F8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance)
	int                                                LimitInventoryUsesTo;                                     // 0x0908(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	bool                                               bInvulnerableInventories;                                 // 0x090C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSupportsLoadouts;                                        // 0x090D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x090E(0x0002) MISSED OFFSET
	struct FText                                       ShortDisplayName;                                         // 0x0910(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<class AMATeamState*>                        TeamArray;                                                // 0x0928(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FTeamConfigEntry>                    TeamConfig;                                               // 0x0938(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FMALoadout                                  DefaultLoadout;                                           // 0x0948(0x0098) (Config)
	class UClass*                                      LightClass;                                               // 0x09E0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      MediumClass;                                              // 0x09E8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      HeavyClass;                                               // 0x09F0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x1C];                                      // 0x09F8(0x001C) MISSED OFFSET
	int                                                MidmatchResetTime;                                        // 0x0A14(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData09[0x50];                                      // 0x0A18(0x0050) MISSED OFFSET
	class AActor*                                      WinningActor;                                             // 0x0A68(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bDeferredRebalanceTeams;                                  // 0x0A70(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bUpdateMatchBalance;                                      // 0x0A71(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x2];                                       // 0x0A72(0x0002) MISSED OFFSET
	int                                                UnbalancedMatchTime;                                      // 0x0A74(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class AMAPlayerState*>                      PlayersAutoChangeTeamDeferred;                            // 0x0A78(0x0010) (ZeroConstructor, Transient)
	bool                                               bMatchSkipped;                                            // 0x0A88(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x7];                                       // 0x0A89(0x0007) MISSED OFFSET
	TMap<struct FString, int>                          MapVotes;                                                 // 0x0A90(0x0050) (ZeroConstructor, Transient)
	struct FString                                     MapOverride;                                              // 0x0AE0(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData12[0x8];                                       // 0x0AF0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.MAGameMode");
		return ptr;
	}


	struct FString ReturnPrefix();
	bool IsWeaponAllowed(class UClass* WeaponClass);
	bool IsThrowableAllowed(class UClass* ThrowableClass);
	bool IsPackAllowed(class UClass* PackClass);
	bool IsDeployableAllowed(class UClass* DeployableClass);
	bool IsCharacterAllowed(class UClass* CharacterClass);
	bool IsAugmentAllowed(class UClass* AugmentClass);
	void FilterDisallowedItems(TArray<class UClass*>* ItemsIn, TArray<class UClass*>* ItemsOut);
};


// Class Midair.ARGameMode
// 0x0008 (0x0B00 - 0x0AF8)
class AARGameMode : public AMAGameMode
{
public:
	int                                                RoundSpawnGracePeriodLength;                              // 0x0AF8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0AFC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.ARGameMode");
		return ptr;
	}

};


// Class Midair.MAPlayerState
// 0x0118 (0x0540 - 0x0428)
class AMAPlayerState : public AGameLiftPlayerState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0428(0x0008) MISSED OFFSET
	class AMATeamState*                                TeamState;                                                // 0x0430(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	class AMATeamState*                                LastTeamState;                                            // 0x0438(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	ESimpleVote                                        PlayerVote;                                               // 0x0440(0x0001) (BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsInitializing;                                          // 0x0441(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0442(0x0002) MISSED OFFSET
	float                                              LastAutoAnnouncerTime;                                    // 0x0444(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              AutoAnnouncerTimeLimit;                                   // 0x0448(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x044C(0x0008) MISSED OFFSET
	bool                                               bIsAlive;                                                 // 0x0454(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0455(0x0003) MISSED OFFSET
	TMap<int, float>                                   LastTimeApplyScoreMap;                                    // 0x0458(0x0050) (ZeroConstructor, Transient)
	int                                                Lives;                                                    // 0x04A8(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	int                                                NumberOfTimesUsedInventory;                               // 0x04AC(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAdmin;                                                 // 0x04B0(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x04B1(0x0003) MISSED OFFSET
	int                                                Kills;                                                    // 0x04B4(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                Deaths;                                                   // 0x04B8(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                Assists;                                                  // 0x04BC(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                Suicides;                                                 // 0x04C0(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                MidairHits;                                               // 0x04C4(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                MidairKills;                                              // 0x04C8(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	float                                              SkillRating;                                              // 0x04CC(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      NewTeamId;                                                // 0x04D0(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x04D1(0x0003) MISSED OFFSET
	int                                                ElapsedTime;                                              // 0x04D4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x10];                                      // 0x04D8(0x0010) MISSED OFFSET
	bool                                               bIsDev;                                                   // 0x04E8(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x04E9(0x0003) MISSED OFFSET
	int                                                RequestChangeTeamCount;                                   // 0x04EC(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bAutoChangedTeam;                                         // 0x04F0(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x04F1(0x0007) MISSED OFFSET
	class UAudioComponent*                             LastPlayerExpressionAudio;                                // 0x04F8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class ADecalActor*                                 LastSpawnedSpray;                                         // 0x0500(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FReplicatedSpawnedSpray                     LastSpawnedSprayInfo;                                     // 0x0508(0x0020) (Net)
	class UClass*                                      VoiceSet;                                                 // 0x0528(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	struct FCauseHitInfo                               LastCauseHitInfo;                                         // 0x0530(0x0008) (Net)
	unsigned char                                      UnknownData09[0x8];                                       // 0x0538(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.MAPlayerState");
		return ptr;
	}


	void UpdateMatchResult(const struct FMatchHistory& MatchHistory);
	void ServerRequestChangeTeam(unsigned char DesiredTeamId);
	void RecordCaptureHighlight();
	void OnRep_NewSpray();
	void OnRep_LastCauseHitInfo();
	void NotifyTeamChanged();
	bool IsAlive();
	void IncrementKills(class UClass* DamageType, class AMAPlayerState* Victim);
	void IncrementDeaths(class UClass* DamageType, class AMAPlayerState* Victim);
	void IncrementAssists(class UClass* DamageType, class AMAPlayerState* Victim);
	EPlayerVoiceState GetPlayerTalkingState();
	void EndHighlights();
	void Client_NotifyScoreApplied(int ScoreID, float Value);
	void AdjustScore(int ScoreAdjustment);
};


// Class Midair.ARPlayerState
// 0x0010 (0x0550 - 0x0540)
class AARPlayerState : public AMAPlayerState
{
public:
	float                                              DamageTaken;                                              // 0x0540(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	float                                              DamageDealt;                                              // 0x0544(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	int                                                FirstBloods;                                              // 0x0548(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x054C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.ARPlayerState");
		return ptr;
	}

};


// Class Midair.Augment_Art
// 0x00A8 (0x00D0 - 0x0028)
class UAugment_Art : public UObject
{
public:
	struct FName                                       ActivateSoundSocketName;                                  // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Activate1P;                                               // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Activate3P;                                               // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  ActiveLoop;                                               // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Deactivate1P;                                             // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  Deactivate3P;                                             // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseActiveMaterials;                                      // 0x0058(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0059(0x0007) MISSED OFFSET
	class UMaterialInterface*                          ActiveMaterial1P;                                         // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInterface*                          ActiveMaterial3P;                                         // 0x0068(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ActivateMaterialLerpTime;                                 // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ActiveMaterialTickRate;                                   // 0x0074(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ActiveMaterialParameterName;                              // 0x0078(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   ActiveMaterialRange;                                      // 0x0080(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	bool                                               bStartActiveMaterialAtMin;                                // 0x0088(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsBuddy;                                                 // 0x0089(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x008A(0x0006) MISSED OFFSET
	class UAugment*                                    OwningAugment;                                            // 0x0090(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class AMACharacter*                                OwningCharacter;                                          // 0x0098(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsActive;                                                // 0x00A0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x00A1(0x0007) MISSED OFFSET
	class UAudioComponent*                             AudioLoopComponent;                                       // 0x00A8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UMaterialInterface*                          OtherActiveMaterial1P;                                    // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMaterialInterface*                          OtherActiveMaterial3P;                                    // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FTimerHandle                                ActiveMaterialUpdateTimer;                                // 0x00C0(0x0008) (Transient)
	unsigned char                                      UnknownData03[0x8];                                       // 0x00C8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_Art");
		return ptr;
	}


	void Tick(float DeltaTime);
	void SetActive_Visuals(bool bActive);
	void SetActive_Audio(bool bActive);
	void SetActive(bool bActive);
};


// Class Midair.Augment_Artillery_Art
// 0x0028 (0x00F8 - 0x00D0)
class UAugment_Artillery_Art : public UAugment_Art
{
public:
	struct FColor                                      WillHitAssetColor;                                        // 0x00D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FColor                                      WontHitAssetColor;                                        // 0x00D4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    PredictionCrosshairTexture;                               // 0x00D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x00E0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_Artillery_Art");
		return ptr;
	}

};


// Class Midair.Augment
// 0x00E0 (0x02B0 - 0x01D0)
class UAugment : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01D0(0x0008) MISSED OFFSET
	class UClass*                                      ArtClass;                                                 // 0x01D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EAugmentType                                       Type;                                                     // 0x01E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x01E1(0x0003) MISSED OFFSET
	float                                              CoolDownTime;                                             // 0x01E4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bNeverRepActive;                                          // 0x01E8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bClientPredict;                                           // 0x01E9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x01EA(0x0006) MISSED OFFSET
	TArray<class UClass*>                              RequiredAugments;                                         // 0x01F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	float                                              EnergyActiveDrainRate;                                    // 0x0200(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              EnergyActivateCost;                                       // 0x0204(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BuddyRange;                                               // 0x0208(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWantsHudDraw;                                            // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDeactivateWhenOwnerFiresWeapon;                          // 0x020D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0xA];                                       // 0x020E(0x000A) MISSED OFFSET
	float                                              LastActivateTime;                                         // 0x0218(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x021C(0x0004) MISSED OFFSET
	class AMABackpack*                                 OwningPack;                                               // 0x0220(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class AMACharacter*                                OwningCharacter;                                          // 0x0228(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      RepTrigger;                                               // 0x0230(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0231(0x0003) MISSED OFFSET
	float                                              CoolDownTimeSince;                                        // 0x0234(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsBuddying;                                              // 0x0238(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x0239(0x0007) MISSED OFFSET
	TArray<class AMACharacter*>                        RepBuddies;                                               // 0x0240(0x0010) (Net, ZeroConstructor, Transient)
	TArray<class AMACharacter*>                        CachedBuddies;                                            // 0x0250(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)
	TMap<class AMACharacter*, class UAugment_Art*>     AugmentArtMap;                                            // 0x0260(0x0050) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment");
		return ptr;
	}


	void ServerUse();
	void ResetType();
	void OnRep_Trigger();
	void OnRep_Buddies();
	void OnRemoved();
	void OnRemoveBuddy(class AMACharacter* Buddy);
	void OnGivenTo();
	void OnEnergyDepleted();
	void OnAddBuddy(class AMACharacter* Buddy);
	void OnActiveChanged(class AMACharacter* ReceivingCharacter);
	void MakePassive();
	void K2_Draw(class UCanvas* Canvas, float RenderDelta);
	bool IsReady();
	float GetCurrentEnergyChangeRate();
	class UAugment_Art* GetArtObjectFor(class AMACharacter* Character);
	bool CanBeUsedWith(class UClass* OtherAugmentClass);
};


// Class Midair.Augment_Artillery
// 0x0040 (0x02F0 - 0x02B0)
class UAugment_Artillery : public UAugment
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02B0(0x0020) MISSED OFFSET
	float                                              TimePerStep;                                              // 0x02D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPredictionTime;                                        // 0x02D4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ActiveTime;                                               // 0x02D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FPredictionMarkerInfo                       PreviousPrediction;                                       // 0x02DC(0x0010) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02EC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_Artillery");
		return ptr;
	}

};


// Class Midair.Augment_Blink
// 0x0110 (0x03C0 - 0x02B0)
class UAugment_Blink : public UAugment
{
public:
	TMap<class UClass*, float>                         BlinkDistances;                                           // 0x02B0(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, float>                         MaxConserveSpeeds;                                        // 0x0300(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TMap<class UClass*, float>                         SpeedOverageReductionPcts;                                // 0x0350(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FVector_NetQuantize10                       StartLocation;                                            // 0x03A0(0x000C) (Net)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03AC(0x0004) MISSED OFFSET
	class UAugment_Blink_Art*                          BlinkArt;                                                 // 0x03B0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x03B8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_Blink");
		return ptr;
	}


	void ReceiveBlinkLocation();
	void OnBlinkOccured();
};


// Class Midair.Augment_Blink_Art
// 0x0020 (0x00F0 - 0x00D0)
class UAugment_Blink_Art : public UAugment_Art
{
public:
	class UParticleSystem*                             StartEffect;                                              // 0x00D0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             EndEffect;                                                // 0x00D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             StartDirectionalEffect;                                   // 0x00E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             EndDirectionalEffect;                                     // 0x00E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_Blink_Art");
		return ptr;
	}


	void StopBlink(const struct FVector& Location);
	void StartBlink(const struct FVector& Location);
};


// Class Midair.Augment_ChargePickup
// 0x0060 (0x0310 - 0x02B0)
class UAugment_ChargePickup : public UAugment
{
public:
	float                                              DefaultPickupCharges;                                     // 0x02B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02B4(0x0004) MISSED OFFSET
	TMap<class UClass*, float>                         PickupCharges;                                            // 0x02B8(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              CurrentPickupCharges;                                     // 0x0308(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x030C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_ChargePickup");
		return ptr;
	}

};


// Class Midair.Augment_ChargePlus
// 0x0060 (0x0310 - 0x02B0)
class UAugment_ChargePlus : public UAugment
{
public:
	float                                              DefaultGrantedCharges;                                    // 0x02B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02B4(0x0004) MISSED OFFSET
	TMap<class UClass*, float>                         GrantedCharges;                                           // 0x02B8(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              CurrentlyGrantedCharges;                                  // 0x0308(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x030C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_ChargePlus");
		return ptr;
	}

};


// Class Midair.Augment_EngineerRegen
// 0x0020 (0x02D0 - 0x02B0)
class UAugment_EngineerRegen : public UAugment
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02B0(0x0008) MISSED OFFSET
	float                                              CyclePeriod;                                              // 0x02B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ChargeRegenRate;                                          // 0x02BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x02C0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_EngineerRegen");
		return ptr;
	}


	void StopRegenTimer();
	void StartRegenTimer();
};


// Class Midair.Augment_FlatShield
// 0x0070 (0x0320 - 0x02B0)
class UAugment_FlatShield : public UAugment
{
public:
	struct FFlatShieldVars                             DefaultShieldVars;                                        // 0x02B0(0x0014) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02C4(0x0004) MISSED OFFSET
	TMap<class UClass*, struct FFlatShieldVars>        ShieldVarsMap;                                            // 0x02C8(0x0050) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0318(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_FlatShield");
		return ptr;
	}


	void OwnerTookDamage(const struct FTakeHitInfo& TakeHitInfo);
};


// Class Midair.Augment_PersonalShield_Art
// 0x0010 (0x00E0 - 0x00D0)
class UAugment_PersonalShield_Art : public UAugment_Art
{
public:
	class USkeletalMeshComponent*                      ShieldMesh3P;                                             // 0x00D0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      ShieldMesh1P;                                             // 0x00D8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_PersonalShield_Art");
		return ptr;
	}

};


// Class Midair.Augment_FlatShield_Art
// 0x0000 (0x00E0 - 0x00E0)
class UAugment_FlatShield_Art : public UAugment_PersonalShield_Art
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_FlatShield_Art");
		return ptr;
	}

};


// Class Midair.Augment_PersonalShield
// 0x0000 (0x02B0 - 0x02B0)
class UAugment_PersonalShield : public UAugment
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_PersonalShield");
		return ptr;
	}

};


// Class Midair.Augment_ShieldIntensityModifier
// 0x0010 (0x02C0 - 0x02B0)
class UAugment_ShieldIntensityModifier : public UAugment
{
public:
	float                                              ShieldStrength;                                           // 0x02B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShieldEfficiency;                                         // 0x02B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x02B8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_ShieldIntensityModifier");
		return ptr;
	}

};


// Class Midair.Augment_RepairTool
// 0x0010 (0x02C0 - 0x02B0)
class UAugment_RepairTool : public UAugment
{
public:
	class AActor*                                      RepairTarget;                                             // 0x02B0(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	class AMARepairGun*                                WeaponItem;                                               // 0x02B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Midair.Augment_RepairTool");
		return ptr;
	}


	void OnSetRepairTarget();
};


// Class Midair.MAItem
// 0x0018 (0x03A0 - 0x0388)
